### Exercícios
Vitor Quintella e Samya De'Lara

Crie um novo banco de dados chamado exercicios (se ele já não existir)

### Loja de Computadores

Execute o código abaixo para criação de tabelas que serão usadas

``` sql
CREATE TABLE Manufacturers (
	Code INTEGER PRIMARY KEY NOT NULL,
	Name CHAR(50) NOT NULL
);

CREATE TABLE Products (
	Code INTEGER PRIMARY KEY NOT NULL,
	Name CHAR(50) NOT NULL ,
	Price REAL NOT NULL ,
	Manufacturer INTEGER NOT NULL
		CONSTRAINT fk_Manufacturers_Code REFERENCES Manufacturers(Code)
);

INSERT INTO Manufacturers
    (Code,Name)
VALUES
    (1,'Sony'),
    (2,'Creative Labs'),
    (3,'Hewlett-Packard'),
    (4,'Iomega'),
    (5,'Fujitsu'),
    (6,'Winchester');

INSERT INTO
    Products(Code,Name,Price,Manufacturer)
VALUES
    (1,'Hard drive',240,5),
    (2,'Memory',120,6),
    (3,'ZIP drive',150,4),
    (4,'Floppy disk',5,6),
    (5,'Monitor',240,1),
    (6,'DVD drive',180,2),
    (7,'CD drive',90,2),
    (8,'Printer',270,3),
    (9,'Toner cartridge',66,3),
    (10,'DVD burner',180,2);
```

#### Coloque o comando SQL abaixo de cada pergunta aqui no notebook (depois de testar no pgAdmin)

1. Selecione os nomes de todos os produtos da loja.
```sql
select name from products;
```

2. Selecione os nomes e os preços de todos os produtos da loja.
```sql
select name,price from products;
```

3. Selecione o nome dos produtos com preço menor ou igual a $200.
```sql
select name from products where price <= 200;
```
4. Selecione todos os produtos com preço entre $60 e $120.
```sql
select name from products where price between 60 and 120;
```
5. Selecione o nome e o preço em centavos (ou seja, o preço deve ser multiplicado por 100).
```sql
select name,price*100 from products;
```

6. Calcule o preço médio de todos os produtos.
```sql
select avg(price) as media_preco from products;
```

7. Calcule o preço médio de todos os produtos com código de fabricante igual a 2.
```sql
select avg(price) as media_preco from products where manufacturer = 2;
```

8. Calcule o número de produtos com preço maior ou igual a $180.
```sql
select count(*) as num_produtos from products where price >= 180;
```

9. Selecione o nome e o preço de todos os produtos com preço maior ou igual a US$ 180 e classifique primeiro por preço (em ordem decrescente) e depois por nome (em ordem crescente).
```sql
select name,price from products where price >= 180 order by price desc,name;
```

10. Selecione todos os dados dos produtos, incluindo todos os dados do fabricante de cada produto.

```sql
select
    products.*
    ,manufacturers.name as manufacturer_name
from products
inner join manufacturers
on products.manufacturer = manufacturers.code
order by manufacturer, products.name;
```
11.Selecione o nome do produto, preço e nome do fabricante de todos os produtos.

```sql
select
    products.name as product_name
    ,products.price as price
    ,manufacturers.name as manufacturer_name
from products
inner join manufacturers
on products.manufacturer = manufacturers.code
order by manufacturer, products.name;
```

12. Selecione o preço médio dos produtos de cada fabricante, mostrando apenas o código do fabricante.
```sql
select manufacturer, avg(price) from products group by manufacturer;
```

13. Selecione o preço médio dos produtos de cada fabricante, mostrando o nome do fabricante.
-- opcao 1: Mais limpo
```sql
select m.name, avg(p.price) from products p inner join manufacturers m on p.manufacturer = m.code group by m.name;
```

-- opcao 2: Menos custoso? (testar com explain)
```sql
select name,media_preco
from
(select manufacturer, avg(price) as media_preco
from products group by manufacturer )
    as t
inner join manufacturers
    on t.manufacturer = manufacturers.code;
```

14. Selecione os nomes dos fabricantes cujos produtos têm preço médio maior ou igual a $150.
```sql
with cte_media as (
    select m.name, avg(p.price) as media_preco
    from products p
    inner join manufacturers m on p.manufacturer = m.code
    group by m.name
    )
select name from cte_media where media_preco >= 150;
```
15. Selecione o nome e o preço do produto mais barato.
```sql
select name,price from products order by price asc limit 1;

-- opcao 2
with cte_min as (select min(price) as min_price from products)
select name, price from products
inner join cte_min on price = cte_min.min_price;
```

16. Selecione o nome de cada fabricante junto com o nome e o preço de seu produto mais caro.
```sql

-- seleciona considerando a possibilidade de mais de um produto com o maior preço
with cte_max as (select manufacturer,max(price) as max_price from products group by manufacturer)
select manufacturers.name, products.name, price from products
right join  cte_max on price = cte_max.max_price and products.manufacturer = cte_max.manufacturer
inner join manufacturers on manufacturers.code = products.manufacturer
order by manufacturers.name, products.name;
```

17. Selecione o nome de cada fabricante que tenha um preço médio acima de $ 145 e contenha pelo menos 2 produtos diferentes.
```sql
with cte_media as (
    select m.name, avg(p.price) as media_preco,  count(distinct p.name) as qtd_produtos
    from products p
    inner join manufacturers m on p.manufacturer = m.code
    group by m.name
    )
select name from cte_media where media_preco > 145 and qtd_produtos> 1;
```

18. Adicione um novo produto: Alto-falantes, US$ 70, fabricante 2.
```sql
insert into products
        (code, name, price, manufacturer)
    values
        ((select MAX(code)+1 from products), 'Alto-falantes', 70, 2);
```
19. Atualize o nome do produto 8 para "Impressora a Laser".
```sql
UPDATE products SET name = 'Impressora a Laser' WHERE code = 8;
```
20. Aplique um desconto de 10% em todos os produtos.
```sql
update products set price = price * (1-0.1);
```
21. Aplique um desconto de 10% em todos os produtos com preço maior ou igual a $120.
```sql
update products set price = price * (1-0.1) where price >= 120;
```

### Gerenciamento de Empregados

![Relacionamento](https://upload.wikimedia.org/wikipedia/commons/thumb/3/36/Employees.png/300px-Employees.png)

Crie as tabelas e relacionamentos conforme diagrama acima.

```sql
CREATE TABLE Departaments (
	Code INTEGER PRIMARY KEY NOT NULL,
	Name CHAR(45) NOT NULL,
	Budget MONEY NOT NULL
);

CREATE TABLE Employees (
    Code INTEGER PRIMARY KEY NOT NULL,
    Name VARCHAR(100) NOT NULL,
    Departament INTEGER NOT NULL,
    CONSTRAINT FK_Departament_Code FOREIGN KEY (Departament) REFERENCES departaments (Code)
);
````

Insira na tabela os valores abaixo

DEPARTMENTS		
CODE	NAME	         BUDGET
    14	IT	             65000
    37	Accounting	     15000
    59	Human Resources	 240000
    77	Research	     55000

Employees
ssn	        name	    lastname	department
123234877	Michael	    Rogers	    14
152934485	Anand	    Manikutty	14
222364883	Carol	    Smith	    37
326587417	Joe	        Stevens	    37
332154719	Mary-Anne	Foster	    14
332569843	George	    O'Donnell	77
546523478	John	    Doe	        59
631231482	David	    Smith	    77
654873219	Zacary	    Efron	    59
745685214	Eric	    Goldsmith	59
845657245	Elizabeth	Doe	        14
845657246	Kumar	    Swamy	    14

```sql
INSERT INTO departaments
    (code, name, budget)
VALUES
       (14, 'IT', 65000),
       (37, 'Accounting', 15000),
       (59, 'Human Resources', 240000),
       (77, 'Research', 55000);


-- Create new column lastname in the table employees
ALTER TABLE employees ADD COLUMN lastname varchar(100);

-- INSERT FOLLOWING DATA INTO THE TABLE employees

INSERT INTO employees
    (code, name, lastname, departament)
VALUES
       (123234877, 'Michael', 'Rogers', 14),
       (152934485, 'Anand', 'Manikutty', 14),
       (222364883, 'Carol', 'Smith', 37),
       (326587417, 'Joe', 'Stevens', 37),
       (332154719, 'Mary-Anne', 'Foster', 14),
       (332569843, 'George', 'O''Donnell', 77),
       (546523478, 'John', 'Doe', 59),
       (631231482, 'David', 'Smith', 77),
       (654873219, 'Zacary', 'Efron', 59),
       (745685214, 'Eric', 'Goldsmith', 59),
       (845657245, 'Elizabeth', 'Doe', 14),
       (845657246, 'Kumar', 'Swamy', 14);
```

1. Selecione o nome e o sobrenome dos funcionários que trabalham para os departamentos com o segundo menor orçamento.

2. Adicione um novo departamento chamado "Garantia de Qualidade", com um orçamento de $ 40.000 e código departamental 11. Adicione um funcionário chamado "Mary Moore" nesse departamento, com SSN 847-21-9811.

3. Reduzir o orçamento de todos os departamentos em 10%.

4. Reatribuir todos os funcionários do departamento de Pesquisa (código 77) para o departamento de TI (código 14).

5. Apague da tabela todos os funcionários do departamento de TI (código 14).

6. Exclua da tabela todos os funcionários que trabalham em departamentos com orçamento maior ou igual a $ 60.000.

7. Exclua da tabela todos os funcionários.

### Titanic

1 - Utilize o site do Kaggle. Iremos baixar o arquivo CSV do Titanic:https://www.kaggle.com/competitions/titanic/data?select=test.csv

2 - Abaixo o dicionário de dados, que também está no Kaggle. Para este exercício, vamos manter a descrição em inglês 

Variable	Definition	    Key
survival	Survival	    0 = No, 1 = Yes
pclass	    Ticket class	1 = 1st, 2 = 2nd, 3 = 3rd
sex	        Sex	
Age	        Age in years	
sibsp	    # of siblings / spouses aboard the Titanic	
parch	    # of parents / children aboard the Titanic	
ticket	    Ticket number	
fare	    Passenger fare	
cabin	    Cabin number	
embarked	Port of Embarkation	C = Cherbourg, Q = Queenstown, S = Southampton

3 - O objetivo desta tarefa é:
    a. Criar quatro tabelas: Survival, pclass, embarked e passageiros. Isso por que para as colunas que possuem uma descrição (Key) é necessário criar uma tabela para cada uma delas.
    b. Usar o arquivo CSV e carregar os respectivos dados em suas tabelas. A criação das tabelas e a inclusão de registros deverá ser feito pelo python
    c. Nas tabelas survival, pclass e emarked não deverá ter valores duplicados

4- Responder as seguintes perguntas via SQL:
    1 - Quantas pessoas sobreviveram do sexo feminino?
    2 - Quantas pessoas do sexo masculino não sobreviveram?
    3 - Agrupar em um unico resultado (mas pode ser usado varias queries) quantas pessoas sobreviveram de 0 a 10 anos, sobreviveram de 11 a 20 anos, sobreviveram de 21 a 40 anos e sobreviveram acima de 40 anos. O resultado devera ter duas colunas, o nome do grupo (por ex: Pessoas de 0 a 10 anos) e a contagem

5 - [Opcional] criar uma função no python para realizar o select, sendo que receberá como parâmetros o select a ser feito e os parâmetros em caso de filtro.